#define _CRT_SECURE_NO_DEPRECATE 0
#include<stdio.h>
int main()
{
	double n=0;
	scanf("%lf", &n);
	if (n <= 100000)
	{
		n = n * 0.1;
	}
	else
	{
		if (n > 100000 && n < 200000)
		{
			n = 100000*0.1 + (n - 100000)*0.075;
		}
		else if (n >= 200000 && n < 400000)
		{
			n = 100000 * 0.1 + 100000 * 0.075 + (n - 200000)*0.05;
		}
		else if (n >= 400000 && n < 600000)
		{
			n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (n - 400000)*0.03;
		}
		else if (n >= 600000 && n < 1000000)
		{
			n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (n - 600000)*0.015;
		}
		else if (n>=1000000)
		{
			n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 200000 * 0.015 + 400000 * 0.015 + (n - 1000000)*0.01;
		}
	}
	printf("%.2lf", n);
	return 0;
}
//题目：企业发放的奖金根据利润提成。
//利润(I)低于或等于10万元时，奖金可提10%；
//利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
//20万到40万之间时，高于20万元的部分，可提成5%；
//40万到60万之间时高于40万元的部分，可提成3%；
//60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？